<!-- Se den kommenterade texten i detta html-dokument f&ouml;r att se exempel och f&ouml;rklaringar p&aring; hur dokumentationen ska vara uppbyggd. -->

<!-- L&auml;nka till detta planeringsdokument i footern till din hemsida. -->

<!DOCTYPE html>
<html lang="sv">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Dokumentation projekt Vt</title>

    <style>
        table,
        td,
        th {
            border: 1px solid black
        }
    </style>

</head>

<body>

    <h1>Dokumentation projekt Vt</h1>

    <h2>1. Id&eacute;beskrivning</h2>
    <!-- Vad ska du g&ouml;ra? Vilken &auml;r din m&aring;lgrupp? Om du utvecklar en tidigare sida; Vad ska du f&ouml;r&auml;ndra/utveckla? -->
    <p>Jag ska bygga en hemsida med information om velodromcykling. M&aring;lgrupp &auml;r huvudsakligen personer som redan k&auml;nner till lite om sporten, men vill veta mer. </p>
    <p> Inf&ouml;r OS 2020 t&auml;nker jag dock att fler kommer att bli intresserade och vilja l&auml;ra sig mer, eftersom att det &auml;r en mindre k&auml;nd sport som kan vara sv&aring;r att f&ouml;rst&aring;, och d&auml;rf&ouml;r beh&ouml;ver
        f&ouml;rklaras. </p>

    <h2>2. Planering</h2>

    <h3>2.1 Handskiss</h3>
    <!-- H&auml;r l&auml;gger du en bild p&aring; din handskiss av layouten. Viktigt att du beskriver vilka boxelement som ska anv&auml;ndas. Visa &auml;ven hur du t&auml;nker med ditt grid (Hur m&aring;nga kolumner?) -->
    <h3>F&ouml;rsta skisserna</h3>
    <p>
        Dessa tv&aring; skisser anv&auml;ndes inte i slut&auml;ndan d&aring; de ritades utan direkt tanke till vad
        jag faktiskt ville ha f&ouml;r innh&aring;ll p&aring; sidan. Ut&ouml;ver det var de inte tillr&auml;ckligt detaljerade,<br>
        utan gav bara en mycket generell ide till layout.
    </p>
    <h4>Desktop</h4>
    <img src="sketch/sketch1-desktop.jpg" alt="F&ouml;rsta skiss till desktopsida" width="1040">
    <h4>Mobile</h4>
    <img src="sketch/sketch1-mobile.jpg" alt="F&ouml;rsta skiss till mobilsida" width="1040">
    <h3>Uppdaterade skisser</h3>
    <p>
        Dessa skisserna gjorde jag mycket senare &auml;n de f&ouml;rsta. N&auml;r jag ins&aring;g att mina f&ouml;rsta
        skisser inte alls d&ouml;g till det jag ville &aring;stadkomma gjorde jag helt enkelt nya.<br>
        Jag gjorde dessa skisser mycker mer detaljerade, och &auml;r faktiskt riktigt n&ouml;jd <br>
        med dem. Om jag bara hade gjort dem fr&aring;n b&ouml;rjan...
    </p>
    <h4>F&ouml;rstasidans layout - Desktop och mobil</h4>
    <img src="sketch/sketch2-first-page-layout.jpg" alt="Skiss till f&ouml;rsta sidans layout" width="1040">

    <h4>Skiss med dubbla och trippla artikelcontainers - Desktop och Mobil</h4>
    <img src="sketch/sketch2-tripple-double.jpg" alt="Skiss som visar m&ouml;jligheter med containers med dubbla och trippla artiklar" width="1040">

    <h4> Gridspecifikationer</h4>
    <img src="sketch/sketch2-grid-specs.jpg" alt="" width="600">
    <h3>2.2 Schema</h3>
    <!-- Vad ska du g&ouml;ra n&auml;r? Inte f&ouml;r detaljerat. -->

    <table>
        <tr>
            <th>Vecka</th>
            <th>P&aring; lektionen</th>
            <th>Utanf&ouml;r lektionen</th>
        </tr>

        <tr>
            <td>4</td>
            <td>
                <!-- Vad g&ouml;rs p&aring; lektionen vecka 4? -->
                Projekt ej p&aring;b&ouml;rjat
            </td>
            <td>
                <!-- Vad g&ouml;rs utanf&ouml;r lektionen vecka 4? -->
            </td>
        </tr>

        <tr>
            <td>5</td>
            <td>
                <!-- Vad g&ouml;rs p&aring; lektionen vecka 5? -->
                Leta id&eacute;er och inspiration f&ouml;r hemsida
            </td>
            <td>
                <!-- Vad g&ouml;rs utanf&ouml;r lektionen vecka 5? -->
            </td>
        </tr>

        <tr>
            <td>6</td>
            <td>
                <!-- Vad g&ouml;rs p&aring; lektionen vecka 6? -->
                Grov skiss

            </td>
            <td>
                <!-- Vad g&ouml;rs utanf&ouml;r lektionen vecka 6? -->

            </td>
        </tr>
        <tr>
            <td>7</td>
            <td>
                <!-- Vad g&ouml;rs p&aring; lektionen vecka 7? -->
                Ingen lektion pga lov
            </td>
            <td>
                <!-- Vad g&ouml;rs utanf&ouml;r lektionen vecka 7? -->
            </td>
        </tr>

        <tr>
            <td>8</td>
            <td>
                <!-- Vad g&ouml;rs p&aring; lektionen vecka 8? -->
                Mer skissande vid behov. Annars p&aring;b&ouml;rja html.
            </td>
            <td>
                <!-- Vad g&ouml;rs utanf&ouml;r lektionen vecka 8? -->
            </td>
        </tr>

        <tr>
            <td>9</td>
            <td>
                <!-- Vad g&ouml;rs p&aring; lektionen vecka 9? -->
                Skriv html. B&ouml;rja med css om m&ouml;jligt.
            </td>
            <td>
                <!-- Vad g&ouml;rs utanf&ouml;r lektionen vecka 9? -->
            </td>
        </tr>

        <tr>
            <td>10</td>
            <td>
                <!-- Vad g&ouml;rs p&aring; lektionen vecka 10? -->
                Javascript &amp; css. Kanske skapa bilder.
            </td>
            <td>
                <!-- Vad g&ouml;rs utanf&ouml;r lektionen vecka 10? -->
                Mer jobb med bilder.
            </td>
        </tr>

        <tr>
            <td>11</td>
            <td>
                <!-- Vad g&ouml;rs p&aring; lektionen vecka 11? -->
                Buffer

            </td>
            <td>
                <!-- Vad g&ouml;rs utanf&ouml;r lektionen vecka 11? -->
                Extra arbete vid behov.
            </td>
        </tr>

        <tr>
            <td>12</td>
            <td>
                <!-- Vad g&ouml;rs p&aring; lektionen vecka 12? -->
                Buffer

            </td>
            <td>
                <!-- Vad g&ouml;rs utanf&ouml;r lektionen vecka 12? -->
                Extra arbete vid behov.

            </td>
        </tr>

        <tr>
            <td>13</td>
            <td>
                <!-- Vad g&ouml;rs p&aring; lektionen vecka 12? -->
                Buffer

            </td>
            <td>
                <!-- Vad g&ouml;rs utanf&ouml;r lektionen vecka 12? -->
                Extra arbete vid behov. L&auml;mna in.

            </td>
        </tr>

    </table>


    <h2>3. Dokumentation</h2>
    <!-- H&auml;r skriver du efter varje lektion. Vad har jag gjort? Vad gick bra? Vad gick mindre bra? Vad ska jag t&auml;nka p&aring; till n&auml;sta g&aring;ng? -->

    <h3>Lektion vecka 4</h3>
    <!-- Fyll p&aring; med dokumentation h&auml;r. -->

    <h3>Lektion vecka 5</h3>
    <!-- Fyll p&aring; med dokumentation h&auml;r. -->

    <h3>Lektion vecka 6</h3>
    <!-- Fyll p&aring; med dokumentation h&auml;r. -->
    <p>P&aring; lektionen vecka sex letade jag inspiration och jobbade p&aring; en skiss.</p>

    <h3>Lektion vecka 8</h3>
    <!-- Fyll p&aring; med dokumentation h&auml;r. -->
    <p>Fortsatte p&aring; skiss. Hade problem med GitHub desktop s&aring; jag kunde inte pusha.</p>

    <h3>Lektion vecka 9</h3>
    <!-- Fyll p&aring; med dokumentation h&auml;r. -->
    <p>L&ouml;ste mina problem med github och p&aring;b&ouml;rjade b&aring;de html och css.</p>

    <h3>Lektion vecka 10</h3>
    <!-- Fyll p&aring; med dokumentation h&auml;r. -->
    <p>Justerade grid-layout f&ouml;r att header och footer skulle str&auml;cka sig
        &ouml;ver hela viewport-bredden i desktopl&auml;ge.</p>
    <p>Ut&ouml;ver det letade jag l&auml;mpliga bilder till sidan.</p>
    <h3>Lektion vecka 11</h3>
    <!-- Fyll p&aring; med dokumentation h&auml;r. -->
    <p>Arbete med layout, skapande av nya html-sidor, skiss av logga.</p>
    <p> Inte en j&auml;tteproduktiv lektion, beh&ouml;ver komma ikapp med planeringen.</p>
    <h3>Lektion vecka 12</h3>
    <p> Inte en speciellt produktiv lektion. Br&aring;kade mycket med photoshop d&aring; jag inte &auml;r s&aring; erfaren i programmet. </p>
    <p> Jag lyckades &auml;ntligen att skapa en l&auml;nk till startsidan i form av min logga. Detta har jag f&ouml;rs&ouml;kt g&ouml;ra l&auml;nge </p>
    <p> Jag ligger r&auml;tt l&aring;ngt efter planeringen men ska se till att bli klar i tid. </p>
    <!-- Fyll p&aring; med dokumentation h&auml;r. -->
    <h3>Lektion vecka 13</h3>
    <p>
        Mycket jobb med att f&aring; sidan responsiv med media queries, vilket den nu &auml;r. Header till stor del klar f&ouml;r b&aring;de desktop och mobile,<br>
        men till mobilsidan m&aring;ste jag f&auml;rdigst&auml;lla curtain-menyn f&ouml;r navigation. Just denna curtain-meny har jag mycket stora problem med.<br>
        Jag f&aring;r den helt enkelt inte att fungera som jag vill, vilket suger upp mycket av min tid. Antagligen &auml;r det n&aring;got litet fel i min <br>
        kod som jag har missat, s&aring; jag f&aring;r forts&auml;tta mitt fels&ouml;kande tills jag hittar det.
    </p>
    <p>
        Hade &auml;n en g&aring;ng problem med GitHub desktop och kunde inte pusha/committa.
    </p>
    <h3>Utanf&ouml;r lektion vecka 13</h3>
    <p>
        Fick den inte s&aring; brillianta iden att helt skriva om koden f&ouml;r min header f&ouml;r att f&aring; den snyggare och g&ouml;ra det l&auml;ttare<br>
        att bygga curtain-menyn. Detta var s&auml;kert en j&auml;ttedum ide som komplicerade allt, men det k&auml;ndes l&auml;ttare i stunden. <br>
        D&auml;rf&ouml;r skrev jag om samtliga l&auml;nkelement fr&aring;n separata div-ar till en osorterad lista. Detta gjorde att jag sedan enklare <br>
        kunde g&ouml;ra s&aring; att flex-naven omvandlas till en curtain-nav med hamburgerknapp p&aring; mobiltelefoner. Under konstruktionen av <br>
        denna hamburgermeny st&ouml;tte jag dock p&aring; ett flertal buggar. F&ouml;rst ville min javascript inte alls fungera, eftersom att jag <br>
        hade missat att specificera att filen l&aring;g i js-mappen. Det felet kostade mig mycket tid och frustration. N&auml;r jag v&auml;l l&ouml;ste<br>
        det uppt&auml;ckte jag att mina l&auml;nkar v&auml;grade synas n&auml;r hamburgermenyn var aktiverad, men jag ins&aring;g att det berodde p&aring; att jag<br>
        hade f&ouml;rs&ouml;kt att animera en fade-in p&aring; l&auml;nkarna, men jag orkade verkligen inte spendera mer tid p&aring; att f&ouml;rs&ouml;ka l&ouml;sa det<br>
        problemet &auml;n jag redan hade. D&auml;rf&ouml;r gav jag upp p&aring; den iden och tog bort den tillh&ouml;rande koden f&ouml;r att se till s&aring; att <br>
        resten av min kod bara skulle fungera felfritt.</p>

    <p>
        N&auml;r arbetet med header/navigation &auml;ntligen var klart skulle jag &aring;terg&aring; till att konstruera de olika html-sidorna. Jag hade <br>
        tidigare gjort misstaget att f&ouml;rs&ouml;ka g&ouml;ra detta innan jag f&auml;rdigst&auml;llt header/navigation, vilket gjorde att jag hade beh&ouml;vt<br>
        justera samtiliga html-filer varje g&aring;ng jag &auml;ndrade n&aring;got. D&auml;rf&ouml;r tog jag en paus fr&aring;n arbete med alla html-filer f&ouml;rutom index <br>
        tills att headern var f&auml;rdig. N&auml;r jag &auml;ntligen skulle &aring;teruppta arbete med samtliga html-sidor ins&aring;g jag att min skiss inte <br>
        l&auml;ngre alls st&auml;mde &ouml;verens med hur jag ville att hemsidan skulle se ut. Den st&auml;mde inte ens &ouml;verens med hur jag hade byggt <br>
        headern/naven. D&auml;rf&ouml;r gjorde jag nya skisser, denna g&aring;ng mer detaljerade.
    </p>
    <p>
        Jag fotade samtliga skisser och lade in dem i planering.html. Jag hade tidigare gl&ouml;mt att g&ouml;ra detta.
    </p>
    <p>
        Med skisserna klara &aring;terupptog jag det tidigare pausade layout-arbetet. F&ouml;rst kopierade jag headern fr&aring;n index.html till de <br>
        andra sidorna f&ouml;r att sedan kunna bygga layouten baserat p&aring; mina uppdaterade skisser.
    </p>
    <p>
        Jag byggde samtliga grids baserat p&aring; mina uppdaterade ritningar, men kopierade dem inte exakt, utan tog anv&auml;nde element <br>
        utifr&aring;n vart de passade inneh&aring;llsm&auml;ssigt. P&aring; vissa st&auml;llen var det l&auml;mpligast med tre artiklar brevid varandra, och p&aring; andra <br>
        st&auml;llen var tv&aring; artiklar mer l&auml;mpliga. Med hj&auml;lp av klasser och id gjorde jag artiklar modul&auml;ra f&ouml;r att enkelt kunna g&ouml;ra det <br>
        tidigare n&auml;mnda.
    </p>
    <p>
        Med gridlayout f&auml;rdig b&ouml;rjade jag l&auml;gga in passande bilder som jag hittade p&aring; internet. Jag var noga med att endast anv&auml;nda <br>
        bilder som jag hade r&auml;tt att anv&auml;nda. F&ouml;r att redovisa vartifr&aring;n jag tagit bilder, samt f&ouml;r att vara tydlig med vem som faktiskt <br>
        &auml;gde bilderna, skapade jag ett nytt credit.html. I detta dokument lade jag in samtliga bilder som jag anv&auml;nt p&aring; sidan, ordnade <br>
        efter vart p&aring; hemsidan de ligger. Under varje bild l&auml;nkar jag till &auml;gare, k&auml;lla och licens. I min footer lade jag en l&auml;nk till <br>
        credit.html s&aring; att man kan komma &aring;t det fr&aring;n min hemsida.
    </p>

    <p>
        N&auml;r sidan var helt f&auml;rdig testade filmade jag alla funktioner p&aring; sidan med shareX, och komprimerade sedan filen med 7zip.
    </p>
    <h2>4. Testning</h2>
    <!-- Testa i Chrome + Firefox eller Safari (p&aring; b&aring;de dator och mobil). Skiljer sig resultatet? Har du beh&ouml;vt anpassa ditt kod/inneh&aring;ll efter de olika webbl&auml;sarna? Hur gick valideringen? Vad s&auml;ger contrastchecker.com om text/bakgrundsf&auml;rg? Hur ser resultatet ut p&aring; en riktig telefon? -->
    <p>
        I b&aring;de Chrome och FireFox fungerade sidan bra, f&ouml;rutom n&auml;r jag anv&auml;nde mobilsimulatorn, d&aring; den l&auml;t mig se s&aring;dant som borde ha g&ouml;mts av <br>
        overflow-x: hidden;. Jag tror att detta &auml;r en bug, men &auml;rligt talat kan det vara jag som har gjort fel. Jag anpassade inte n&aring;got till <br>
        till en specifik webbl&auml;sare. Jag testade att k&ouml;ra min hemsida med ett r&ouml;stsyntesprogram, och uppt&auml;ckte ett par felaktiga alt-taggar <br>
        som jag fixade till. N&auml;r jag validerade alla html-filer f&ouml;rutom events.html gick allt bra. I events.html have jag m&aring;nga problem. <br>
        Felen l&aring;g i det att jag hade satt tv&aring; attribut p&aring; mina artikel-containers, id och class. Jag hade gjort detta f&ouml;r att kunna kontrollera <br>
        flera likadana containers, viket fungerade, men det var tydligen inte till&aring;tet. Jag &auml;ndrade detta genom att byta id-erna mot klasser, och <br>
        ta bort de mer generella klass-attributen fr&aring;n dessa containers. Detta gjorde att min kod accepterades av validatorn utan att sidan gick s&ouml;nder. <br>
        Planering.html och credit.html validerades utan fel efter att jag encodat dem och bytt ut copyright tecken mot motsvarigheten i html-kod. Innan de encodats tyckte validatorn
        inte om &aring;&auml;&ouml;. Css och js validerades utan fel. <br>
        I contrast checker fick jag goda betyg p&aring; n&auml;stan allt, f&ouml;rutom en mycket viktig sak - naven. Den ljusbl&aring; bakgrunden med vit text gav uruselt kontrast. <br>
        Tyv&auml;rr fanns det inte tid kvar till att &aring;tg&auml;rda detta p&aring; ett bra s&auml;tt. Till sist minifierade jag min css och lyckades p&aring; s&aring; s&auml;tt halvera storleken p&aring; <br>
        min css. Jag sparade filen som style.min.css i css-mappen.
    </p>
    <h2>5. Utv&auml;rdering</h2>
    <!-- Ex: Vad gick bra/mindre bra? (i arbetet/din f&ouml;rm&aring;ga).
 Nyanserat: "hur hade det blivit om jag ist&auml;llet hade...?"
 Konkreta f&ouml;rb&auml;ttringsf&ouml;rslag i produkt + process. -->
    <p>
        Mycket i detta projektet gick faktiskt riktigt d&aring;ligt. Fr&aring;n b&ouml;rjan underskattade jag grovt hur mycket tid detta projekt skulle ta <br>
        Jag skyller det till viss del p&aring; att detta &auml;r mitt f&ouml;rsta projekt av denna skala, men jag kunde verkligen ha funderat lite mer &ouml;ver <br>
        hur arbetet borde l&auml;ggas upp. Min perfektionism fick mig att bygga om sidan ett flertal g&aring;nger, vilket innebar att jag lade <br>
        Mycket tid p&aring; saker som aldrig anv&auml;ndes p&aring; n&aring;got s&auml;tt. Det tydligaste exemplet p&aring; detta &auml;r hur jag i b&ouml;rjan hela tiden &auml;ndrade p&aring; <br>
        sidans struktur eftersom att jag aldrig blev n&ouml;jd. Jag kunde ha undvikit detta helt om jag fr&aring;n b&ouml;rjan hade gjort en b&auml;ttre skiss, <br>
        en som b&aring;de var detaljerad nog att arbeta efter, men ocks&aring; en som jag faktiskt var n&ouml;jd med. Mitt andra stora fel i projektet var <br>
        det att jag skapade samtliga sidor fr&aring;n b&ouml;rjan, vilket gjorde att jag beh&ouml;vde uppdatera de alla n&auml;r jag h&ouml;ll p&aring; att bygga nav/header. <br>
        Om jag ist&auml;llet bara hade b&ouml;rjat med att bygga header/nav p&aring; min index-sida hade jag helt sluppit detta och sparat hur mycket tid <br>
        som helst. N&aring;got som f&ouml;r en g&aring;ng skull var n&aring;gorlunda bra var arbetet som f&ouml;ljde efter att jag blivit klar med nav/header. D&aring; kunde <br>
        jag p&aring; riktigt arbeta med sidans layout, vilket jag denna g&aring;ng FAKTISKT baserade p&aring; en skiss, dock inte orginalskissen. Att jag gjorde <br>
        nya skisser tog ocks&aring; en del tid, men det var det faktsikt v&auml;rt i slut&auml;ndan, d&aring; det gav mig n&aring;got konkret att arbeta utefter, vilket <br>
        orginalskisserna verkligen inte gav. Om jag bara hade gjort samma skiss i projektets b&ouml;rjan och sedan utg&aring;tt ifr&aring;n den s&aring; hade hela <br>
        arbetsprocessen varit s&aring; mycket b&auml;ttre! &Auml;nnu en sak som tog mycket tid var bristande erfarenhet. Jag beh&ouml;vde m&aring;nga g&aring;nger under arbetet <br>
        s&ouml;ka upp olika saker p&aring; internet d&aring; jag inte var s&auml;ker p&aring; hur de skulle g&ouml;ras. Det var dock inte n&aring;got som jag hade kunnat g&ouml;ra mycket &aring;t, <br>
        men nu vet jag att jag &auml;r mer kunnig inf&ouml;r n&auml;sta arbete &auml;n jag var innan detta.
    </p>
    <p>
        Jag &aring;ngrar ocks&aring; att jag inte l&auml;sta bed&ouml;mningsmatrisen ordentligt innan jag p&aring;b&ouml;rjade mitt arbete. Eftersom att jag inte gjorde det <br>
        har jag inte dokumenterat tillr&auml;ckligt noga. Jag f&ouml;rstod f&ouml;rst inte riktigt hur ing&aring;ende dokumentationen skulle vara, vilket skadade <br>
        arbetet i helhet.
    </p>
    <p>
        Under arbetets g&aring;ng har jag vid flera tillf&auml;llen haft problem med GitHub desktop, vilket har hindrat mig fr&aring;n att pusha eller committa, men hoppas p&aring; <br>
        att jag ska f&aring; det att fungar i tid till inl&auml;mning. Detta &auml;r s&auml;kert helt mitt fel, s&aring; tills n&auml;sta projekt ska jag se till att GitHub <br>
        fungerar felfritt f&ouml;r mig.
    </p>

    <p>
        Produkten i sig sj&auml;lvt &auml;r jag faktiskt r&auml;tt s&aring; n&ouml;jd med. F&ouml;rutom kontrastproblemet i headern s&aring; fungerar sidan riktigt bra. Kontrastporblemet <br>
        Skulle r&auml;tt enkelt kunna &aring;tg&auml;rdas genom att s&auml;tta en svart outline p&aring; den vita texten. Detta borde kunna g&ouml;ras med en text-shadow. Jag hade <br>
        ocks&aring; tyckt att det var trevligt om sidan var anpassad f&ouml;r tablets ocks&aring;. Detta skulle jag antagligen g&ouml;ra genom att anv&auml;nda hamburgermenyn <br>
        i kombination med delar av desktop-layouten, s&aring; att artiklar sitter bredvid varandra ist&auml;llet f&ouml;r bara ovanp&aring; varandra. Vissa texter p&aring; sidan <br>
        skrevs lite v&auml;l hastigt, s&aring; de skulle absolut kunna utvecklas. Jag skulle g&auml;rna skriva p&aring; b&aring;de bikes.html och events.html, f&ouml;r att g&ouml;ra sidan <br>
        mer intressant.
    </p>
</body>

</html>
